rtkconnectivity/RTL876x3E-Common-SDK/src/sample/io_demo/i2c/master_write/i2c_mw_demo.c
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: LicenseRef-Realtek-5-Clause
 */

/*============================================================================*
 *                              Header Files
 *============================================================================*/
#include "rtl876x_pinmux.h"
#include "rtl876x_rcc.h"
#include "rtl876x_i2c.h"
#include "trace.h"

/** @defgroup  I2C_MW_DEMO  I2C MASTER WRITE DEMO
    * @brief  I2C master write data implementation demo code
    * @{
    */

/*============================================================================*
 *                              Macros
 *============================================================================*/
/** @defgroup I2C_MasterWrite_Exported_Macros I2C Master Write Exported Macros
  * @brief
  * @{
  */

#define PIN_I2C1_SCL                P0_0
#define PIN_I2C1_SDA                P0_1

#define ADDR              0x08

/** @} */ /* End of group I2C_MasterWrite_Exported_Macros */

/*============================================================================*
 *                              Functions
 *============================================================================*/
/** @defgroup I2C_MasterWrite_Exported_Functions I2C Master Write Exported Functions
  * @brief
  * @{
  */

/**
  * @brief  initialization of pinmux settings and pad settings.
  * @param   No parameter.
  * @return  void
  */
static void board_i2c_init(void)
{
    Pinmux_Config(PIN_I2C1_SDA, I2C1_DAT);
    Pinmux_Config(PIN_I2C1_SCL, I2C1_CLK);
    Pad_Config(PIN_I2C1_SDA, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE,
               PAD_OUT_HIGH);
    Pad_Config(PIN_I2C1_SCL, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE,
               PAD_OUT_HIGH);
}

/**
  * @brief  Initialize ADC peripheral.
  * @param   No parameter.
  * @return  void
  */
static void driver_i2c_init(void)
{
    RCC_PeriphClockCmd(APBPeriph_I2C1, APBPeriph_I2C1_CLOCK, ENABLE);

    I2C_InitTypeDef  I2C_InitStructure;
    I2C_StructInit(&I2C_InitStructure);

    I2C_InitStructure.I2C_ClockSpeed = 400000;
    I2C_InitStructure.I2C_DeviveMode = I2C_DeviveMode_Master;
    I2C_InitStructure.I2C_AddressMode = I2C_AddressMode_7BIT;
    I2C_InitStructure.I2C_SlaveAddress = ADDR;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;

    I2C_Init(I2C1, &I2C_InitStructure);

    I2C_Cmd(I2C1, ENABLE);
}

/**
  * @brief  demo code of operation about I2C.
  * @param   No parameter.
  * @return  void
  */
void i2c_mw_demo(void)
{
    uint8_t I2C_WriteBuf[16] = {0xaa, 0xbb, 0x66, 0x68, 0x77, 0x88};

    board_i2c_init();

    driver_i2c_init();

    if (I2C_Success != I2C_MasterWrite(I2C1, I2C_WriteBuf, 6))
    {
        IO_PRINT_ERROR0("i2c_mw_demo: Send failed");

        //Check Event
        if (I2C_CheckEvent(I2C1, ABRT_7B_ADDR_NOACK) == SET)
        {
            IO_PRINT_ERROR0("i2c_mw_demo: Wrong addr");
        }
        if (I2C_CheckEvent(I2C1, ABRT_GCALL_NOACK) == SET)
        {
            IO_PRINT_ERROR0("i2c_mw_demo: General call nack");
        }
        I2C_SendCmd(I2C1, I2C_WRITE_CMD, 0, I2C_STOP_ENABLE);
        I2C_Cmd(I2C1, DISABLE);
        I2C_Cmd(I2C1, ENABLE);
        if (I2C_Success != I2C_MasterWrite(I2C1, I2C_WriteBuf, 6))
        {
            IO_PRINT_ERROR0("i2c_mw_demo: Send failed again");
        }
    }
}
/** @} */ /* End of group I2C_MasterWrite_Exported_Functions */
/** @} */ /* End of group I2C_MW_DEMO */

